{
"type": "FeatureCollection",
"name": "buffalo",
"crs": { "type": "name", "properties": { "name": "urn:ogc:def:crs:EPSG::3857" } },
"features": [
{ "type": "Feature", "properties": { "X": -135.328064, "Y": 59.46602, "title": "Skagway, Alaska, and the Klondike Gold Rush", "when": "1899-1902", "order": 1, "City": "Skagway", "State": "AK", "text": "After serving in the Spanish-American war, soldiers of Company L of the 24th Infantry departed from Seattle and arrived in Dyea and Skagway in Alaska. Relieving white soldiers of the 14th Infantry, they were primarily charged with maintaining law and order among miners and securing the border with Canada during the Klondike Gold Rush. They also patrolled Skagway, formed one of its first baseball teams and provided assistance during Skagway's flood in 1901. ", "photourl": "assets\/Skagway.JPG", "caption": "Company L, 24th Infantry lines up in Skagway, Alaska for a July 4th parade in 1899. (Photo courtesy of Alaska State Library, Paul Sincic Collection, Photographer Harrie C. Barley, ASL-P75-144)", "link": "https:\/\/www.nps.gov\/klgo\/learn\/historyculture\/buffalo-soldiers.htm", "link2": null }, "geometry": { "type": "Point", "coordinates": [ -135.32806, 59.46602 ] } },
{ "type": "Feature", "properties": { "X": -116.778037, "Y": 47.676393, "title": " Coeur d'Alene, Idaho", "when": "1899", "order": 2, "City": "Coeur D'Alene", "State": "ID", "text": "In 1899, soldiers of Company B of the 24th Regiment who were stationed at Fort Vancouver near Portland, Ore., were among the first federal troops to arrive in Coeur d'Alene, Idaho, after a miners strike grew violent and a mill owned by the Bunker Hill and Sullivan Mining Company was destroyed with dynamite. The regiments enforced martial law, took control of railroad and telegraph lines and guarded prisoners. ", "photourl": "assets\/CoeurdAlene.JPG", "caption": "Ruins of the Bunker Hill ore mill in Wardner, Idaho, after being dynamited by union miners in 1899. Buffalo soldiers were sent in to impose martial law. (T.A. Rickard, The Bunker Hill Enterprise)", "link": null, "link2": null }, "geometry": { "type": "Point", "coordinates": [ -116.77804, 47.67639 ] } },
{ "type": "Feature", "properties": { "X": -117.463997, "Y": 47.67464, "title": "Fort George Wright - Spokane", "when": "1899, 1908-1909, 1911", "order": 3, "City": "Spokane", "State": "WA", "text": "The 24th Infantry Regiment was stationed at Fort George Wright in Spokane for a year in 1899, during which time the local community protested and petitioned for them to be sent elsewhere. The soldiers were eventually sent to the Philippines. In 1908 the 25th Infantry was stationed at Fort George Wright in Spokane.", "photourl": null, "caption": null, "link": "https:\/\/www.seattletimes.com\/seattle-news\/a-look-at-fort-lawton\/", "link2": null }, "geometry": { "type": "Point", "coordinates": [ -117.464, 47.67464 ] } },
{ "type": "Feature", "properties": { "X": -122.411999, "Y": 47.656243, "title": "Fort Lawton - Seattle", "when": "1909-1913, 1944", "order": 4, "City": "Seattle", "State": "WA", "text": "900 men of the 25th Infantry were transferred from the Philippines to Seattle's Fort Lawton  in 1909. Their families followed a year later, and together they made up one-third of the black population of Seattle at the time. In 1913, these troops were transferred to Hawaii. ", "photourl": "assets\/lawton.JPG", "caption": "A 1912 photograph of the \"Non-Commissioned Staff and Band, 25th Infantry\" in Fort Lawton, Seattle, is on display at The Buffalo Soldiers Museum in Tacoma. (Bettina Hansen \/ The Seattle Times)", "link": null, "link2": null }, "geometry": { "type": "Point", "coordinates": [ -122.412, 47.65624 ] } },
{ "type": "Feature", "properties": { "X": -123.96558, "Y": 46.178775, "title": "Fort Stevens - Warrenton, Oregon", "when": "1895-1898", "order": 5, "City": "Warrenton", "State": "OR", "text": "Sgt. Moses Williams, a recipient of the Medal of Honor for his role in the Indian Wars, was stationed at Fort Stevens on the Oregon Coast in the twilight of his military career, serving as caretaker and overseeing ordnance. He retired in 1898 after 32 years of service. He is buried in the Fort Vancouver Military Cemetery in Vancouver, Wash. ", "photourl": "assets\/Stevens.JPG", "caption": "Ordnance Sgt. Moses Williams, U.S. Army, a recipient of the Medal of Honor. Portrait taken between 1886 and 1898. (Unknown)", "link": null, "link2": null }, "geometry": { "type": "Point", "coordinates": [ -123.96558, 46.17878 ] } },
{ "type": "Feature", "properties": { "X": -122.655119, "Y": 45.62584, "title": "Fort Vancouver ", "when": "1899", "order": 6, "City": "Vancouver", "State": "WA", "text": "Soldiers of Company B of the 24th Infantry were garrisoned for 13 months at Fort Vancouver, where their duties included drills, military marches, infrastructure maintenance and clerical work. They were deployed from here to deal with unrest in the mining community in Coeur D'Alene, Idaho. ", "photourl": null, "caption": null, "link": null, "link2": null }, "geometry": { "type": "Point", "coordinates": [ -122.65512, 45.62584 ] } },
{ "type": "Feature", "properties": { "X": -122.466587, "Y": 37.798103, "title": "The Presidio - San Francisco", "when": "1903-1904", "order": 7, "City": "San Francisco", "State": "CA", "text": "Buffalo soldiers of the 24th Infantry and 9th and 10th Horse Cavalry were stationed at The Presidio in San Francisco after the Spanish-American and Philippine-American wars. Several of these soldiers were eventually dispatched to Yosemite National Park and Sequoia National Park, where they served as the first park rangers. More than 400 buffalo soldiers are buried at The Presidio.", "photourl": "assets\/presidio.JPG", "caption": "On May 12, 1903, President Theodore Roosevelt, lower left, rides in a carriage for an honor guard parade escorted by the 9th U.S. Calvary Regiment, an all-black company, at the Golden Gate National Recreation Area. (National Park Service)", "link": "https:\/\/www.nps.gov\/prsf\/learn\/historyculture\/presidio-garrison.htm", "link2": "https:\/\/www.nps.gov\/prsf\/learn\/historyculture\/buffalo-soldiers-buried-at-san-francisco-national-cemetery.htm" }, "geometry": { "type": "Point", "coordinates": [ -122.46659, 37.7981 ] } }
]
}
